docs/entityDiagram/contoh.puml
@startuml erd
class User {
    id: int
    nama: string
    contoh()
}

class Mahasiwa {
    ubahnama()
    id: int
    budi()
    nim: string 
}

class Dosen {
    id: int
    nim: string
}

User <|-- Mahasiswa
User <|-- Dosen
User ||--o{ : upload

@enduml
